app/views/results/index.html.erb

    <%= text_field_tag :search, params[:search], options = {style:"width:200px"} %>
    <%= select_tag :collage_name, options_for_select(Student.pluck(:collage_name).uniq, params[:collage_name]), :prompt => "Select Collage Name" %>
---
SELECT "students"."collage_name" FROM "students"