app/controllers/collages_controller.rb

  def index
  	@collages = Collage.all
---
SELECT "collages".* FROM "collages"

  def create
  	@collage = Collage.new(collage_params)
  	if @collage.save
---
INSERT INTO "collages" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "K.S.SCHOOL OF BUSINESS MANAGEMENT"], ["created_at", "2018-09-27 11:08:12.575263"], ["updated_at", "2018-09-27 11:08:12.575263"]]