app/controllers/questions_tests_controller.rb

  def update
    @question_ids = params[:test][:question_ids].reject(&:empty?)
    @questions = Question.find(@question_ids)
---
SELECT  "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" IN (1, 2)

  def find_test
    @test =  Test.find(params[:id])
---
SELECT  "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]