app/controllers/questions_controller.rb

INSERT INTO "questions" ("question_description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"
---
  def create
    @question = Question.new(question_params)
    if @question.save