app/controllers/results_controller.rb

  def index
    if(params[:search] || params[:collage_name])
      @results =  Result.joins(:student).includes(student: :test).where('students.email ilike ? and students.collage_name ilike ?', "%#{params[:search]}%", "%#{params[:collage_name]}%")
    else
      @results = Result.includes(student: :test)
---
SELECT "students"."collage_name" FROM "students"

  def technical_answers
    @student = @result.student
    @answers = @student.answers.includes(:question)
---
SELECT "answers".* FROM "answers" WHERE "answers"."student_id" = $1  [["student_id", 1]]