app/controllers/students_controller.rb

INSERT INTO "students" ("name", "email", "course", "roll_number", "collage_name", "created_at", "updated_at", "test_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @student = Student.new(student_params)

    # pr loc no_tech true
    if @student.preferred_position&.non_tech
      # for mcq
      @student.test_id = Test.non_technical.ids.sample
    else
      # for code question
      @student.test_id = Test.technical.ids.sample
    end
    # else
    # @student.test_id = Test.technical.ids.sample
    if @student.save

UPDATE "students" SET "test_started" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["test_started", "t"], ["updated_at", "2018-09-27 11:15:16.695925"], ["id", 1]]
---
  def update
    if @student.update(student_params)