app/controllers/student_answers_controller.rb

 def create
   params[:response_item].each{|k, value|
      @student_answer = StudentAnswer.new
      @student_answer.student = Student.find(session[:student_id])
      @student_answer.question_id = k
      @student_answer.option_id = value
      @student_answer.test_id = Student.find(session[:student_id]).test.id
      @student_answer.save
    }

    @result =  Result.new
    @student = Student.find(session[:student_id])
    @result.student_id = @student.id
    @count = 0
    @student.student_answers.each do |i|
      if i.option.is_answer== true && i.test_id == @student.test_id
        @count += 1
      end
    end
    @result.correct_answer = @count
    @result.attempted_questions = @student.student_answers.where(test_id: @student.test_id).count
    @result.total_questions = @student.test.questions.count
    @result.test_id = @student.test.id
    @result.save
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "results" ("student_id", "total_questions", "attempted_questions", "correct_answer", "test_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"