app/controllers/student_answers_controller.rb

  def new
    if session[:student_id].present?
      @student_answer = StudentAnswer.new
      return redirect_to root_path if @student.test_started?
      @student.update_attributes(test_started: false, start_time: DateTime.now)
---
UPDATE "students" SET "start_time" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["start_time", "2018-09-27 11:15:16.184837"], ["updated_at", "2018-09-27 11:15:16.189869"], ["id", 1]]

  def create
    params[:response_item] && params[:response_item].each{|k, value|
      @student_answer = StudentAnswer.create(
                          student_id: session[:student_id],
                          question_id: k,
                          option_id: value,
                          test_id: @student.test.id)
    }

    @result =  Result.new(student_id: @student.id)
    @count = 0
    @student.student_answers.map {|i| @count+=1 if (i.option.is_answer == true && i.test_id == @student.test_id)}
    @test = @student.test
    @result.update_attributes(correct_answer: @count,
                              attempted_questions: @student.student_answers.where(test_id: @test.id).count,
                              total_questions: @test.questions.count,
                              test_id: @test.id)
    # redirect_to root_path
    flash[:success] = "Your Aptitude Test submitted successfully"
    tech_test = Test.technical.ids.sample
    if tech_test.present? && @student.preferred_position.tech
---
INSERT INTO "student_answers" ("student_id", "question_id", "option_id", "created_at", "updated_at", "test_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["student_id", 1], ["question_id", 1], ["option_id", 2], ["created_at", "2018-09-27 11:15:29.946380"], ["updated_at", "2018-09-27 11:15:29.946380"], ["test_id", 1]]
SELECT  "options".* FROM "options" WHERE "options"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "student_answers".* FROM "student_answers" WHERE "student_answers"."student_id" = $1  [["student_id", 1]]
SELECT COUNT(*) FROM "student_answers" WHERE "student_answers"."student_id" = $1 AND "student_answers"."test_id" = $2  [["student_id", 1], ["test_id", 1]]
SELECT COUNT(*) FROM "questions" INNER JOIN "questions_tests" ON "questions"."id" = "questions_tests"."question_id" WHERE "questions_tests"."test_id" = $1  [["test_id", 1]]
UPDATE "students" SET "test_id" = $1, "test_started" = $2, "updated_at" = $3 WHERE "students"."id" = $4  [["test_id", 2], ["test_started", "f"], ["updated_at", "2018-09-27 11:15:29.999818"], ["id", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new_technical
    if session[:student_id].present?
      @answer = Answer.new
      return redirect_to root_path if @student.test_started?
      @student.update_attributes(test_started: false, start_time: DateTime.now)
---
UPDATE "students" SET "start_time" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["start_time", "2018-09-27 11:15:30.017704"], ["updated_at", "2018-09-27 11:15:30.020388"], ["id", 1]]

  def create_technical
    params[:response_item] && params[:response_item].each{|k, value|
      @answer = Answer.create(
                          student_id: session[:student_id],
                          question_id: k,
                          answer: value,
                        )
---
INSERT INTO "answers" ("question_id", "created_at", "updated_at", "student_id", "answer") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def find_student
    @student = Student.find(session[:student_id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]