app/controllers/technical_questions_controller.rb

INSERT INTO "questions" ("question_description", "created_at", "updated_at", "is_technical") VALUES ($1, $2, $3, $4) RETURNING "id"  [["question_description", "<p>Write a program for sorting array.</p>\r\n"], ["created_at", "2018-09-27 11:16:56.224878"], ["updated_at", "2018-09-27 11:16:56.224878"], ["is_technical", "t"]]
---
  def create
    @technical_question = Question.new(technical_question_params)
    @technical_question.is_technical = true
    if @technical_question.save