app/controllers/tests_controller.rb

INSERT INTO "tests" ("name", "created_at", "updated_at", "total_time", "is_technical") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Test2"], ["created_at", "2018-09-27 11:05:00.547565"], ["updated_at", "2018-09-27 11:05:00.547565"], ["total_time", "00:20"], ["is_technical", "t"]]
---
  def create
    @test = Test.new(test_params)
    if @test.save

UPDATE "tests" SET "is_technical" = $1, "updated_at" = $2 WHERE "tests"."id" = $3  [["is_technical", "t"], ["updated_at", "2018-09-27 11:02:21.573419"], ["id", 1]]
---
  def update
    if @test.update(test_params)

SELECT  "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def find_test
    @test = Test.find(params[:id])