app/views/student_answers/_form.html.erb


      <% @student.test.questions.order('random()').limit(25).each_with_index do |question, index| %>
---
SELECT "questions".* FROM "questions" INNER JOIN "questions_tests" ON "questions"."id" = "questions_tests"."question_id" WHERE "questions_tests"."test_id" = $1  [["test_id", 1]]

            <div class="option-container col-md-12">
              <% question.options.order(:option).each do |option| %>
---
SELECT "options".* FROM "options" WHERE "options"."question_id" = $1 ORDER BY "options"."option" ASC  [["question_id", 1]]