app/views/tests/show.html.erb

	  <p><%= index + 1 %>.<%= question.question_description %></p>
		<% question.options.each do |option| %>
---
SELECT "options".* FROM "options" WHERE "options"."question_id" = $1  [["question_id", 1]]